In [3]:
import pandas as pd

df = pd.DataFrame([1,2,3],
                  columns=['value'])

In [8]:
df

   value
0      1
1      2
2      3

In [9]:
df2 = pd.DataFrame([('apple', 160), ('orange', 30), ('kiwi', 80), ('banana', 120)], columns=['name','price'])

In [11]:
df2

     name  price
0   apple    160
1  orange     30
2    kiwi     80
3  banana    120

In [12]:
data = {
    'fruit': ['apple', 'orange', 'kiwi', 'banana'],
    'price': [160, 30, 80, 120],
    'order': [12, 30, 8,21]
}

df3 = pd.DataFrame(data)

In [14]:
df3

    fruit  order  price
0   apple     12    160
1  orange     30     30
2    kiwi      8     80
3  banana     21    120

In [15]:
df3['total'] = df3['price'] * df3['order']

In [16]:
df3

    fruit  order  price  total
0   apple     12    160   1920
1  orange     30     30    900
2    kiwi      8     80    640
3  banana     21    120   2520

In [17]:
df4 = pd.DataFrame(data, index=['apple', 'orange', 'kiwi', 'banana'])

In [20]:
df4

         fruit  order  price
apple    apple     12    160
orange  orange     30     30
kiwi      kiwi      8     80
banana  banana     21    120

In [22]:
df4.ix['apple']

fruit    apple
order       12
price      160
Name: apple, dtype: object

In [26]:
df4.shape

(4, 3)

In [31]:
df3['fruit']

0     apple
1    orange
2      kiwi
3    banana
Name: fruit, dtype: object

In [33]:
df3[['fruit', 'total']]

    fruit  total
0   apple   1920
1  orange    900
2    kiwi    640
3  banana   2520

In [35]:
df3.head(2)

    fruit  order  price  total
0   apple     12    160   1920
1  orange     30     30    900

In [37]:
df3.tail(1)

    fruit  order  price  total
3  banana     21    120   2520

In [39]:
df3[1:3]

    fruit  order  price  total
1  orange     30     30    900
2    kiwi      8     80    640

In [41]:
df3[:2]

    fruit  order  price  total
0   apple     12    160   1920
1  orange     30     30    900

In [44]:
df3.loc[[0,3]]

    fruit  order  price  total
0   apple     12    160   1920
3  banana     21    120   2520

In [53]:
df3.sample(n=2)

   fruit  order  price  total
2   kiwi      8     80    640
0  apple     12    160   1920

In [57]:
df3[df3.price < 100]

    fruit  order  price  total
1  orange     30     30    900
2    kiwi      8     80    640

In [59]:
df3.where(df3.price < 100)

    fruit  order  price  total
0     NaN    NaN    NaN    NaN
1  orange   30.0   30.0  900.0
2    kiwi    8.0   80.0  640.0
3     NaN    NaN    NaN    NaN

In [64]:
df3.where(df3.price < 100).dropna()

    fruit  order  price  total
1  orange   30.0   30.0  900.0
2    kiwi    8.0   80.0  640.0

In [67]:
df3.where(df3.price < 100).fillna(df3.mean())

    fruit  order  price   total
0     NaN  17.75   97.5  1495.0
1  orange  30.00   30.0   900.0
2    kiwi   8.00   80.0   640.0
3     NaN  17.75   97.5  1495.0

In [78]:
df3.apply(lambda x: x.fruit.upper(), axis=1)

0     APPLE
1    ORANGE
2      KIWI
3    BANANA
dtype: object

In [84]:
df3.apply(lambda y: y*2, axis=0)

          fruit  order  price  total
0    appleapple     24    320   3840
1  orangeorange     60     60   1800
2      kiwikiwi     16    160   1280
3  bananabanana     42    240   5040